simulations/cfd/phaseforge_channel_3d/constant/transportProperties.moderate
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2212                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Moderate-temperature analogue (~60-70 C). Hydrodynamics only.
// Absolute hydrostatic pressure is NOT a chemical-rate variable here.

phases (water oil);

water
{
    transportModel  Newtonian;
    nu              [0 2 -1 0 0 0 0] 4.1e-07;
    rho             [1 -3 0 0 0 0 0] 983;
}

oil
{
    transportModel  Newtonian;
    nu              [0 2 -1 0 0 0 0] 5.1e-07;
    rho             [1 -3 0 0 0 0 0] 960;
}

sigma           [1 0 -2 0 0 0 0] 0.004;

// ************************************************************************* //
